app/controllers/school_classes_controller.rb

    def index
        @all_classes = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

    def create
        @class = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Xbox"], ["room_number", 1007]]